title: A scheduled task was created
id: 92a6faf5-78ec-4e25-bea1-73bacc9b59d9
status: stable
description: Indicates the creation of a scheduled task using Windows event logs.
  Adversaries can use these to establish persistence, move laterally, and/or escalate
  privileges.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698
tags:
- 'Data Source: Windows Security Event Logs'
- 'Tactic: Persistence'
- attack.ta0003
- 'OS: Windows'
- attack.t1053
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- 'Domain: Endpoint'
- attack.persistence
level: low
logsource:
  category: unknown
  product: windows
  index:
  - logs-system.security*
  - logs-windows.forwarded*
  - winlogbeat-*
detection:
  selection:
    eql_query: "iam where host.os.type == \"windows\" and event.action == \"scheduled-task-created\"\
      \ and\n\n /* excluding tasks created by the computer account */\n not user.name\
      \ : \"*$\" and\n\n /* TaskContent is not parsed, exclude by full taskname noisy\
      \ ones */\n not winlog.event_data.TaskName : (\n              \"\\\\CreateExplorerShellUnelevatedTask\"\
      ,\n              \"\\\\Hewlett-Packard\\\\HPDeviceCheck\",\n              \"\
      \\\\Hewlett-Packard\\\\HP Support Assistant\\\\WarrantyChecker\",\n        \
      \      \"\\\\Hewlett-Packard\\\\HP Support Assistant\\\\WarrantyChecker_backup\"\
      ,\n              \"\\\\Hewlett-Packard\\\\HP Web Products Detection\",\n   \
      \           \"\\\\Microsoft\\\\VisualStudio\\\\Updates\\\\BackgroundDownload\"\
      ,\n              \"\\\\OneDrive Standalone Update Task-S-1-5-21*\",\n      \
      \        \"\\\\OneDrive Standalone Update Task-S-1-12-1-*\"\n )\n"
  condition: selection
falsepositives:
- Legitimate scheduled tasks may be created during installation of new software.
fields:
- event.action
- host.os.type
- user.name
- winlog.event_data.TaskName
