title: Account Discovery
id: 9694bff7-c66b-440e-be94-2a8254f85111
status: stable
description: 'Detects account discovery commands. APT29 uses ''net user /domain''
  and ''net user %USERNAME% /domain''

  to enumerate domain user accounts and gather information about specific users for
  targeting

  in privilege escalation or lateral movement.'
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.discovery
- Windows
- MITRE
- attack.ta0007
- APT29
- attack.t1087
level: low
logsource:
  category: process_creation
  product: windows
  index:
  - winlogbeat-*
detection:
  selection:
    keywords:
    - "host.os.type:windows and\n(\n  (event.category : process and (process.name\
      \ : \"net.exe\" or process.name : \"net1.exe\") and \n   process.command_line\
      \ : *user* and process.command_line : */domain*) or\n  (event.code : \"4104\"\
      \ and \n   powershell.file.script_block_text : (*Get-ADUser* or *Get-DomainUser*\
      \ or *net*user*/domain*))\n)"
  condition: selection
falsepositives:
- Unknown
fields: []
