title: Hidden Files and Directories via Attrib
id: 168b5887-8555-4b8c-b36a-6c82061492c1
status: stable
description: 'Detects creation of hidden files and directories using attrib.exe (+h
  flag) or PowerShell attributes modification.

  APT36 uses this technique to hide malware and artifacts from user view. Monitors
  for attrib.exe execution with +h or +s flags,

  and PowerShell Set-ItemProperty operations targeting file attributes.'
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.defense_evasion
- attack.t1564
- Windows
- MITRE
- attack.ta0005
- APT36
level: medium
logsource:
  category: process_creation
  product: windows
  index:
  - winlogbeat-*
detection:
  selection:
    keywords:
    - "host.os.type: \"windows\" AND\n(\n  (\n    event.code: \"600\" AND\n    process.command_line:\
      \ (*Get-Item* OR *gi* OR *gci* OR *Get-ChildItem*) AND\n    process.command_line:\
      \ *.attributes* AND\n    process.command_line: (*Hidden* OR *System*)\n  )\n\
      \  OR\n  (\n    event.code: \"1\" AND\n    process.name: \"attrib.exe\" AND\n\
      \    process.command_line: (*+h* OR *+s* OR */h* OR */s*)\n  )\n)"
  condition: selection
falsepositives:
- Unknown
fields: []
