title: Microsoft Defender ASR Rules Disabled or Deleted via PowerShell
id: af7cef99-b62e-4a1f-8794-43aa86ee4113
status: stable
description: "This rule detects PowerShell modifying or deleting Microsoft Defender\
  \ Attack Surface Reduction (ASR) rules through Group Policy–controlled registry\
  \ paths:\n\nHKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\\n    Windows\
  \ Defender Exploit Guard\\ASR\\Rules"
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.defense_evasion
- Windows
- MITRE
- attack.t1562
- attack.ta0005
- Kill_chain
level: high
logsource:
  category: process_creation
  product: windows
  index:
  - winlogbeat-*
detection:
  selection:
    keywords:
    - "host.os.type:\"windows\" and\nprocess.command_line: *Windows*Defender*Exploit*Guard*\
      \ and\nprocess.command_line: *ASR* and\n(\n  process.command_line: *New-ItemProperty*\
      \ or\n  process.command_line: *Remove-ItemProperty*\n)\n"
  condition: selection
falsepositives:
- Unknown
fields: []
