title: Namespace Manipulation Using Unshare
id: d00f33e7-b57d-4023-9952-2db91b1767c4
status: stable
description: Identifies suspicious usage of unshare to manipulate system namespaces.
  Unshare can be utilized to escalate privileges or escape container security boundaries.
  Threat actors have utilized this binary to allow themselves to escape to the host
  and access other resources or escalate privileges.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references:
- https://man7.org/linux/man-pages/man1/unshare.1.html
- https://www.crowdstrike.com/blog/cve-2022-0185-kubernetes-container-escape-using-linux-kernel-exploit/
tags:
- 'Tactic: Privilege Escalation'
- attack.ta0004
- 'Data Source: SentinelOne'
- attack.t1543
- 'OS: Linux'
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- attack.privilege_escalation
- 'Data Source: Elastic Defend'
- 'Domain: Endpoint'
- 'Data Source: Elastic Endgame'
level: medium
logsource:
  category: process_creation
  product: linux
  index:
  - auditbeat-*
  - endgame-*
  - logs-endpoint.events.process*
  - logs-sentinel_one_cloud_funnel.*
detection:
  selection:
    eql_query: 'process where host.os.type == "linux" and event.type == "start" and
      event.action : ("exec", "exec_event", "start") and

      process.executable: "/usr/bin/unshare" and

      not process.parent.executable: ("/usr/bin/udevadm", "*/lib/systemd/systemd-udevd",
      "/usr/bin/unshare") and

      not process.args == "/usr/bin/snap" and not process.parent.name in ("zz-proxmox-boot",
      "java")

      '
  condition: selection
falsepositives:
- Unknown
fields:
- event.action
- event.type
- host.os.type
- process.args
- process.executable
- process.parent.executable
- process.parent.name
