title: Potential Malicious PowerShell Based on Alert Correlation
id: f770ce79-05fd-4d74-9866-1c5d66c9b34b
status: stable
description: Identifies PowerShell script blocks associated with multiple distinct
  detections, indicating likely malicious behavior.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references: []
tags:
- 'Rule Type: Higher-Order Rule'
- 'Tactic: Execution'
- 'OS: Windows'
- attack.ta0002
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- 'Domain: Endpoint'
- attack.t1059
- attack.execution
level: high
logsource:
  category: process_creation
  product: windows
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
fields:
- Esql._id_values
- Esql.kibana_alert_rule_name_count_distinct
- Esql.kibana_alert_rule_name_values
- Esql.script_block_id
