title: PowerShell Download & Execution of Mimikatz via PowerSploit (Invoke-Mimikatz)
id: 24e5f935-4019-407b-ba25-48d09c4decbc
status: stable
description: 'This rule detects the execution of Mimikatz using the PowerSploit framework’s
  Invoke-Mimikatz.ps1 script.

  The activity involves downloading the script directly from a remote GitHub repository
  using:


  IEX (Invoke-Expression)


  (New-Object Net.WebClient).DownloadString()


  Execution of Invoke-Mimikatz -DumpCreds


  This technique is commonly used by attackers to dump credentials stored in memory,
  including NTLM hashes, Kerberos tickets, and plaintext passwords.'
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.ta0006
- attack.t1059
- Kill_chain
- MITRE
- attack.execution
- attack.ta0002
- Windows
- attack.t1003
- attack.credential_access
level: high
logsource:
  category: process_creation
  product: windows
  index:
  - winlogbeat-*
detection:
  selection:
    kql_query: 'host.os.type:"windows" and

      event.code:"600" and

      process.command_line: *IEX* and

      process.command_line: *DownloadString* and

      process.command_line: *PowerSploit* and

      process.command_line: *Invoke-Mimikatz*

      '
  condition: selection
falsepositives:
- Unknown
fields: []
