title: PowerShell MiniDump Script
id: 577ec21e-56fe-4065-91d8-45eb8224fe77
status: stable
description: This rule detects PowerShell scripts capable of dumping process memory
  using WindowsErrorReporting or Dbghelp.dll MiniDumpWriteDump. Attackers can use
  this tooling to dump LSASS and get access to credentials.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references:
- https://github.com/PowerShellMafia/PowerSploit/blob/master/Exfiltration/Out-Minidump.ps1
- https://github.com/FuzzySecurity/PowerShell-Suite/blob/master/Get-ProcessMiniDump.ps1
- https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md
tags:
- attack.ta0006
- 'Tactic: Credential Access'
- attack.credential_access
- 'OS: Windows'
- attack.ta0002
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- attack.t1003
- 'Domain: Endpoint'
- attack.t1059
- attack.execution
- 'Data Source: PowerShell Logs'
level: high
logsource:
  category: process_creation
  product: windows
  index:
  - winlogbeat-*
  - logs-windows.powershell*
detection:
  selection:
    keywords:
    - 'event.category:process and host.os.type:windows and powershell.file.script_block_text:(MiniDumpWriteDump
      or MiniDumpWithFullMemory or pmuDetirWpmuDiniM) and not user.id : "S-1-5-18"

      '
  condition: selection
falsepositives:
- PowerShell scripts that use this capability for troubleshooting.
fields:
- event.category
- host.os.type
- powershell.file.script_block_text
- user.id
