title: Remote Scheduled Task Creation via RPC
id: 9c865691-5599-447a-bac9-b3f2df5f9a9d
status: stable
description: Identifies scheduled task creation from a remote source. This could be
  indicative of adversary lateral movement.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references: []
tags:
- 'Data Source: Windows Security Event Logs'
- attack.ta0008
- attack.t1021
- 'OS: Windows'
- attack.ta0002
- attack.t1053
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- attack.lateral_movement
- 'Domain: Endpoint'
- attack.execution
- 'Tactic: Lateral Movement'
level: medium
logsource:
  category: process_creation
  product: windows
  index:
  - logs-system.security*
  - logs-windows.forwarded*
  - winlogbeat-*
detection:
  selection:
    eql_query: "iam where host.os.type == \"windows\" and event.action == \"scheduled-task-created\"\
      \ and\n winlog.event_data.RpcCallClientLocality : \"0\" and winlog.event_data.ClientProcessId\
      \ : \"0\"\n"
  condition: selection
falsepositives:
- Unknown
fields:
- event.action
- host.os.type
- winlog.event_data.ClientProcessId
- winlog.event_data.RpcCallClientLocality
