title: SeDebugPrivilege Enabled by a Suspicious Process
id: 97020e61-e591-4191-8a3b-2861a2b887cd
status: stable
description: Identifies the creation of a process running as SYSTEM and impersonating
  a Windows core binary privileges. Adversaries may create a new process with a different
  token to escalate privileges and bypass access controls.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4703
- https://blog.palantir.com/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
tags:
- 'Data Source: Windows Security Event Logs'
- attack.t1134
- 'Tactic: Privilege Escalation'
- attack.ta0004
- 'OS: Windows'
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- attack.privilege_escalation
- 'Domain: Endpoint'
level: medium
logsource:
  category: process_creation
  product: windows
  index:
  - logs-system.security*
  - logs-windows.forwarded*
  - winlogbeat-*
detection:
  selection:
    eql_query: "any where host.os.type == \"windows\" and event.provider: \"Microsoft-Windows-Security-Auditing\"\
      \ and\n event.action : \"Token Right Adjusted Events\" and\n\n winlog.event_data.EnabledPrivilegeList\
      \ : \"SeDebugPrivilege\" and\n\n /* exclude processes with System Integrity\
      \  */\n not winlog.event_data.SubjectUserSid : (\"S-1-5-18\", \"S-1-5-19\",\
      \ \"S-1-5-20\") and\n\n not winlog.event_data.ProcessName :\n         (\"?:\\\
      \\Windows\\\\System32\\\\msiexec.exe\",\n          \"?:\\\\Windows\\\\SysWOW64\\\
      \\msiexec.exe\",\n          \"?:\\\\Windows\\\\System32\\\\lsass.exe\",\n  \
      \        \"?:\\\\Windows\\\\WinSxS\\\\*\",\n          \"?:\\\\Program Files\\\
      \\*\",\n          \"?:\\\\Program Files (x86)\\\\*\",\n          \"?:\\\\Windows\\\
      \\System32\\\\MRT.exe\",\n          \"?:\\\\Windows\\\\System32\\\\cleanmgr.exe\"\
      ,\n          \"?:\\\\Windows\\\\System32\\\\taskhostw.exe\",\n          \"?:\\\
      \\Windows\\\\System32\\\\mmc.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\
      \\Local\\\\Temp\\\\*-*\\\\DismHost.exe\",\n          \"?:\\\\Windows\\\\System32\\\
      \\auditpol.exe\",\n          \"?:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSe.exe\"\
      ,\n          \"?:\\\\Windows\\\\SysWOW64\\\\wbem\\\\WmiPrvSe.exe\")\n"
  condition: selection
falsepositives:
- Unknown
fields:
- event.action
- event.provider
- host.os.type
- winlog.event_data.EnabledPrivilegeList
- winlog.event_data.ProcessName
- winlog.event_data.SubjectUserSid
