title: SSH Distributed Brute Force
id: 229b5fdd-b2cf-4f28-9f5f-3a12b078bcdd
status: stable
description: Distributed Brute Force – Multiple IPs Targeting Same User
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.t1110
- attack.credential_access
- attack.ta0006
level: high
logsource:
  category: unknown
  product: linux
  index:
  - auditbeat-*
detection:
  selection:
    eql_query: "sequence by user.name with maxspan=10m\n  [ authentication\n     \
      \ where event.category == \"authentication\"\n      and event.outcome == \"\
      failure\"\n      and event.type == \"authentication_failure\"\n  ] with runs=5\n"
  condition: selection
falsepositives:
- Unknown
fields: []
