title: Suspicious Remote PowerShell User Enumeration via Invoke-Command
id: 2eaf5f4e-6e13-459a-97b2-9c208f34395d
status: stable
description: This rule detects the execution of a PowerShell command that remotely
  queries user session information on a Windows host using Invoke-Command together
  with Get-Process -IncludeUserName.
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- MITRE
- attack.ta0002
- Kill_chain
- attack.t1059
- attack.execution
level: medium
logsource:
  category: process_creation
  product: linux
  index:
  - winlogbeat-*
detection:
  selection:
    keywords:
    - "host.os.type:\"windows\" and event.code:\"403\" and\n(\n  process.command_line:\
      \ *Invoke-Command* or\n  process.command_line: *ICM* or\n  process.command_line:\
      \ *Invoke-Expression*\n) and (\n  process.command_line: *Get-Process* or\n \
      \ process.command_line: *gps*\n) and\nprocess.command_line: *IncludeUserName*\
      \ and\nprocess.command_line: *hostname*\n"
  condition: selection
falsepositives:
- Unknown
fields: []
