title: System Service Discovery
id: 1349b253-0f87-4a0d-a840-7a82a36c8936
status: stable
description: 'Detects system service discovery commands. APT29 uses ''sc query'' and
  ''net start'' to enumerate

  running services on compromised systems. This helps attackers identify security
  software,

  potential persistence mechanisms, and services that could be exploited.'
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.discovery
- Windows
- MITRE
- attack.ta0007
- attack.t1007
- APT29
level: low
logsource:
  category: process_creation
  product: windows
  index:
  - winlogbeat-*
detection:
  selection:
    keywords:
    - "host.os.type:windows and\n(\n  (event.category : process and process.name :\
      \ \"sc.exe\" and process.command_line : *query*) or\n  (event.category : process\
      \ and (process.name : \"net.exe\" or process.name : \"net1.exe\") and \n   process.command_line\
      \ : *start* and not process.command_line : (*/y* or *start /wait*)) or\n  (event.code\
      \ : \"4104\" and \n   powershell.file.script_block_text : (*Get-Service* or\
      \ *sc*query*))\n)"
  condition: selection
falsepositives:
- Unknown
fields: []
