title: T1074.001 – Staging Sensitive Files
id: a023b3a2-7d5e-49e7-8a50-9ec04096b5da
status: stable
description: Detects the copying, moving, or creation of files in world-writable directories
  (/tmp, /dev/shm), specifically targeting sensitive file extensions.
author: []
date: '2025-12-09'
modified: '2025-12-08'
references: []
tags:
- attack.t1074
- Linux
- MITRE
- attack.collection
- Auditbeat
- attack.ta0009
level: high
logsource:
  category: process_creation
  product: linux
  index:
  - auditbeat-*
detection:
  selection:
    keywords:
    - "agent.type: \"auditbeat\" AND\nevent.action: \"executed\" AND\nprocess.name:\
      \ (\"cp\" OR \"mv\" OR \"rsync\" OR \"cat\" OR \"dd\") AND\nprocess.args: (\"\
      /tmp/*\" OR \"/var/tmp/*\" OR \"/dev/shm/*\" OR \"/run/shm/*\") AND\nprocess.args:\
      \ (\n    \"*.tar.gz\" OR \"*.zip\" OR \"*.gz\" OR \"*.rar\" OR\n    \"*id_rsa*\"\
      \ OR \"*.pem\" OR \"*.key\" OR\n    \"*.kdbx\" OR \"*.db\" OR \"*.sqlite\" OR\n\
      \    \"*.env\" OR \"*token*\" OR \"*secret*\" OR \"*password*\"\n) AND\nNOT\
      \ process.args: (\n    \"/tmp/apt-key-gpghome*\" OR\n    \"/tmp/systemd-private-*\"\
      \ OR\n    \"/var/tmp/systemd*\" OR\n    \"/var/tmp/snap.*\" OR\n    \"/var/tmp/apt-*\"\
      \ OR\n    \"/tmp/krb5cc_*\" OR\n    \"/tmp/pip-*\" OR\n    \"/tmp/tmp.*\"\n\
      ) \n"
  condition: selection
falsepositives:
- Unknown
fields: []
