title: Unusual Child Processes of RunDLL32
id: f036953a-4615-4707-a1ca-dc53bf69dcd5
status: stable
description: Identifies child processes of unusual instances of RunDLL32 where the
  command line parameters were suspicious. Misuse of RunDLL32 could indicate malicious
  activity.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references: []
tags:
- attack.t1218
- 'Tactic: Defense Evasion'
- attack.defense_evasion
- 'OS: Windows'
- 'Data Source: Crowdstrike'
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- attack.ta0005
- 'Data Source: Elastic Defend'
- 'Domain: Endpoint'
- 'Data Source: Sysmon'
level: high
logsource:
  category: process_creation
  product: windows
  index:
  - logs-endpoint.events.process-*
  - winlogbeat-*
  - logs-windows.sysmon_operational-*
  - logs-crowdstrike.fdr*
detection:
  selection:
    eql_query: "sequence with maxspan=1h\n  [process where host.os.type == \"windows\"\
      \ and event.type == \"start\" and\n     (process.name : \"rundll32.exe\" or\
      \ process.pe.original_file_name == \"RUNDLL32.EXE\") and\n      (process.args_count\
      \ == 1 and\n        /* Excludes bug where a missing closing quote sets args_count\
      \ to 1 despite extra args */\n        not process.command_line regex~ \"\"\"\
      \\\".*\\.exe[^\\\"].*\"\"\")\n  ] by process.entity_id\n  [process where host.os.type\
      \ == \"windows\" and event.type == \"start\" and process.parent.name : \"rundll32.exe\"\
      \n  ] by process.parent.entity_id\n"
  condition: selection
falsepositives:
- Unknown
fields:
- event.type
- host.os.type
- process.args_count
- process.command_line
- process.entity_id
- process.name
- process.parent.entity_id
- process.parent.name
- process.pe.original_file_name
