title: User Account Creation
id: 1aa9181a-492b-4c01-8b16-fa0735786b2b
status: stable
description: Identifies attempts to create new users. This is sometimes done by attackers
  to increase access or establish persistence on a system or domain.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references: []
tags:
- 'Data Source: Microsoft Defender for Endpoint'
- 'Data Source: Windows Security Event Logs'
- attack.persistence
- 'Tactic: Persistence'
- attack.ta0003
- 'Data Source: Sysmon'
- 'Use Case: Threat Detection'
- 'OS: Windows'
- 'Data Source: Elastic Endgame'
- 'Data Source: Elastic Defend'
- 'Data Source: Crowdstrike'
- attack.t1136
- 'Domain: Endpoint'
- 'Resources: Investigation Guide'
- 'Data Source: SentinelOne'
level: low
logsource:
  category: process_creation
  product: windows
  index:
  - endgame-*
  - logs-crowdstrike.fdr*
  - logs-endpoint.events.process-*
  - logs-m365_defender.event-*
  - logs-sentinel_one_cloud_funnel.*
  - logs-system.security*
  - logs-windows.forwarded*
  - logs-windows.sysmon_operational-*
  - winlogbeat-*
detection:
  selection:
    eql_query: "process where host.os.type == \"windows\" and event.type == \"start\"\
      \ and\n  (process.name : (\"net.exe\", \"net1.exe\") and not process.parent.name\
      \ : \"net.exe\") and\n  (process.args : \"user\" and process.args : (\"/ad\"\
      , \"/add\"))\n"
  condition: selection
falsepositives:
- Unknown
fields:
- event.type
- host.os.type
- process.args
- process.name
- process.parent.name
