title: Volume Shadow Copy Deletion via WMIC
id: dc9c1f74-dac3-48e3-b47f-eb79db358f57
status: stable
description: Identifies use of wmic.exe for shadow copy deletion on endpoints. This
  commonly occurs in tandem with ransomware or other destructive attacks.
author:
- Elastic
date: '2025-12-09'
modified: '2025-12-05'
references: []
tags:
- attack.t1490
- 'Data Source: SentinelOne'
- attack.impact
- 'Use Case: Threat Detection'
- 'Data Source: Elastic Defend'
- 'Tactic: Execution'
- 'Data Source: Microsoft Defender for Endpoint'
- 'Data Source: Sysmon'
- 'Data Source: Crowdstrike'
- 'Data Source: Elastic Endgame'
- attack.ta0002
- 'Tactic: Impact'
- attack.ta0040
- 'Data Source: Windows Security Event Logs'
- attack.t1047
- 'OS: Windows'
- attack.execution
- 'Domain: Endpoint'
- 'Resources: Investigation Guide'
level: high
logsource:
  category: process_creation
  product: windows
  index:
  - endgame-*
  - logs-crowdstrike.fdr*
  - logs-endpoint.events.process-*
  - logs-m365_defender.event-*
  - logs-sentinel_one_cloud_funnel.*
  - logs-system.security*
  - logs-windows.forwarded*
  - logs-windows.sysmon_operational-*
  - winlogbeat-*
detection:
  selection:
    eql_query: "process where host.os.type == \"windows\" and event.type == \"start\"\
      \ and\n  (process.name : \"WMIC.exe\" or ?process.pe.original_file_name == \"\
      wmic.exe\") and\n  process.args : \"delete\" and process.args : \"shadowcopy\"\
      \n"
  condition: selection
falsepositives:
- Unknown
fields:
- event.type
- host.os.type
- process.args
- process.name
- process.pe.original_file_name
