title: Windows Event Logs Cleared
id: 45ac4800-840f-414c-b221-53dd36a5aaf7
status: stable
description: Identifies attempts to clear Windows event log stores. This is often
  done by attackers in an attempt to evade detection or destroy forensic evidence
  on a system.
author:
- Elastic
- Anabella Cristaldi
date: '2025-12-09'
modified: '2025-12-05'
references: []
tags:
- 'Data Source: Windows Security Event Logs'
- 'Tactic: Defense Evasion'
- attack.defense_evasion
- 'Data Source: Windows System Event Logs'
- 'OS: Windows'
- 'Use Case: Threat Detection'
- 'Resources: Investigation Guide'
- attack.ta0005
- 'Domain: Endpoint'
- attack.t1070
level: low
logsource:
  category: unknown
  product: windows
  index:
  - winlogbeat-*
  - logs-system.security*
  - logs-system.system*
  - logs-windows.forwarded*
detection:
  selection:
    keywords:
    - "host.os.type:windows and event.action:(\"audit-log-cleared\" or \"Log clear\"\
      ) and\n  not winlog.provider_name:\"AD FS Auditing\"\n"
  condition: selection
falsepositives:
- Unknown
fields:
- event.action
- host.os.type
- winlog.provider_name
